admin_panel/ADMIN_STOCKACCOUNT_DELECTION_TESTING/admin_stockAccount_DELECTION_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: admin_stockAccount_DELECTION_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: admin_stockAccount_DELECTION_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  admin_stockAccount_DELECTION_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/Administator/stockAccount)
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByXPath((//a[contains(text(),'Delete')])[2])
      # WARN: Command Not yet supported. ('assertConfirmation:"Do you want to delete":""')
      # WARN: Command Not yet supported. ('chooseOkOnNextConfirmation:"":""')
      - clickByXPath((//a[contains(text(),'Delete')])[5])
      # WARN: Command Not yet supported. ('assertConfirmation:"Do you want to delete":""')

  admin_stockAccount_DELECTION_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/Administator/stockAccountDelete/1005'
            method: GET
            label: 'http://localhost:33143/Administator/stockAccountDelete/1005'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/stockAccount'
          - url: 'http://localhost:33143/Administator/stockAccountDelete/1005'
            method: GET
            label: 'http://localhost:33143/Administator/stockAccountDelete/1005'
            think-time: 1ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/stockAccount'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAACKl2K%2BHcY1wlWgx%2FCW3HIuy1cg1nHb1ve5KV1YthDXmQAAAAAOgAAAAAIAACAAAABNA82aD9mvgMgnzUoAx3g90E0cWck242ykM3N1eu4mkDAAAADYVviQoGzzFnZrBUEHq4Z9KWUrAHP%2BvVoO%2BtJcnY0v3xO8JzPnOseyK1g3TCblnv5AAAAALZnCYKgEui0I%2FUAZ1U2bSUPIZJ7DckoknC8AQzvdsX2BPgfrxxIiBWK%2B%2B4sX0TrXGy9x5RIZ6IXLXME1gIaSCg%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FstockAccount&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAACKl2K%2BHcY1wlWgx%2FCW3HIuy1cg1nHb1ve5KV1YthDXmQAAAAAOgAAAAAIAACAAAABNA82aD9mvgMgnzUoAx3g90E0cWck242ykM3N1eu4mkDAAAADYVviQoGzzFnZrBUEHq4Z9KWUrAHP%2BvVoO%2BtJcnY0v3xO8JzPnOseyK1g3TCblnv5AAAAALZnCYKgEui0I%2FUAZ1U2bSUPIZJ7DckoknC8AQzvdsX2BPgfrxxIiBWK%2B%2B4sX0TrXGy9x5RIZ6IXLXME1gIaSCg%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FstockAccount&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/stockAccount'
          - url: 'http://localhost:33143/Administator/stockAccount'
            method: GET
            label: 'http://localhost:33143/Administator/stockAccount'
            think-time: 5735ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/stockAccount'
            body:
              requestUrl: 'http://localhost:33143/Administator/stockAccount'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546071149895'
          - url: 'http://localhost:33143/__browserLink/requestData/2d8ecb12bcbe4d9bbdbb0f7befba6821'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/2d8ecb12bcbe4d9bbdbb0f7befba6821'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/stockAccount'
          - url: 'http://localhost:33143/Administator/stockAccountDelete/1009'
            method: GET
            label: 'http://localhost:33143/Administator/stockAccountDelete/1009'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/stockAccount'
          - url: 'http://localhost:33143/Administator/stockAccountDelete/1009'
            method: GET
            label: 'http://localhost:33143/Administator/stockAccountDelete/1009'
            think-time: 12ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/stockAccount'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABD9BEp9HEklBYkmIeM0t4y5f0Hb6juu0hjk6My%2F2vsEAAAAAAOgAAAAAIAACAAAABQ1t4gk6SAIuWQoYfwDiN9wIN1iwwWtVZbHZ8fNGID6DAAAADOekj%2BD3EJNZoN1aZTWHIt%2F%2FhAF7Kuqr22ZbXElqNhD5ivlmx61ZspQzT8Jb%2F%2BUHtAAAAAWRUrBRFpvd0ZsKZJYrV%2BfPlONBz8ilap4RYmx1QATF7KUkVmwpcPzrjK4aYA31%2BGCfAXQww8J4VhERcp4cuMGQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FstockAccount&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABD9BEp9HEklBYkmIeM0t4y5f0Hb6juu0hjk6My%2F2vsEAAAAAAOgAAAAAIAACAAAABQ1t4gk6SAIuWQoYfwDiN9wIN1iwwWtVZbHZ8fNGID6DAAAADOekj%2BD3EJNZoN1aZTWHIt%2F%2FhAF7Kuqr22ZbXElqNhD5ivlmx61ZspQzT8Jb%2F%2BUHtAAAAAWRUrBRFpvd0ZsKZJYrV%2BfPlONBz8ilap4RYmx1QATF7KUkVmwpcPzrjK4aYA31%2BGCfAXQww8J4VhERcp4cuMGQ%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FstockAccount&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/stockAccount'
          - url: 'http://localhost:33143/Administator/stockAccount'
            method: GET
            label: 'http://localhost:33143/Administator/stockAccount'
            think-time: 1377ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
              Referer: 'http://localhost:33143/Administator/'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
              Referer: 'http://localhost:33143/Administator/stockAccount'
            body:
              requestUrl: 'http://localhost:33143/Administator/stockAccount'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546071156478'
          - url: 'http://localhost:33143/__browserLink/requestData/d7ca7e153d724d3588e121a4d99293e0'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/d7ca7e153d724d3588e121a4d99293e0'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
              Referer: 'http://localhost:33143/Administator/stockAccount'